# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

ch1 = input("Введите 1-е число: ")
ch2 = input("Введите 2-е число: ")

def del_ch(arg_1, arg_2):
    """ Принимает два позиционных аргумента и возвращает частное от деления."""
    try:
        arg = int(arg_1) / int(arg_2)
    except ZeroDivisionError:
        arg = 'Ошибка: деление на ноль!'
    return arg

print(del_ch(ch1, ch2))


# 2. Выполнить функцию, которая принимает несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы. Осуществить вывод данных о пользователе одной строкой.

def gata_polz(nam, nam_f, g_rd, g_pr, eml, telf):
    """Возвращает строку, содержащую информацию из именованных параметров.
    Именованные параметры:
    nam -- "Иван"
    nam_f -- "Петров"
    g_rd -- 1983
    g_pr -- "Омск"
    eml -- "ivan_petrov@mail.ru"
    telf -- "+79170234845"
    """
    return print(f"Имя: {nam}, фамилия: {nam_f}, год рождения: {g_rd}, город проживания: {g_pr}, email: {eml}, "
                 f"телефон: {telf}")

gata_polz(nam="Иван", nam_f="Петров", g_rd=1983, g_pr="Омск", eml="ivan_petrov@mail.ru",
          telf="+79170234845")

# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента и возвращает сумму наибольших двух аргументов.

arg_1 = int(17)
arg_2 = int(38)
arg_3 = int(41)

def max_2_iz_3(ar_1, ar_2, ar_3):
    """ Принимает три позиционных аргумента и возвращает сумму наибольших двух из них."""
    summa = 0
    lst = [ar_1, ar_2, ar_3]
    lst.sort()
    lst.reverse()
    for i in range(len(lst) - 1):
        summa += lst[i]
    return summa

print(max_2_iz_3(arg_1, arg_2, arg_3))

# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.

# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.

x = 3
y = -2

def my_func(x, y):
    """ Принимает действительное положительное число x и возводит его в степень целого отрицательного числа y."""
    return x ** y

print(my_func(x, y))

# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

x = 2
y = -5

def my_func(x, y):
    """ Принимает действительное положительное число x и возводит его в степень целого отрицательного числа y."""
    x0 = 1
    for i in range(abs(y)):
        x0 *= 1 / (x)
    return x0

print(my_func(x, y))

# 5. Программа запрашивает у пользователя строку чисел, разделённых пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделённых пробелом и снова нажать Enter.
# Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введён после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее
# сумме и после этого завершить программу.

stroka = ""
sp_symbol = "="

def summ(stroka):
    """ Принимает числа, разделенные пробелом и возвращает их сумму."""
    st0 = stroka.split()
    summa0 = 0
    for i in range(len(st0)):
        summa0 += int(st0[i])
    return summa0

summa = 0

while sp_symbol not in stroka:
    stroka = input("Введите числа, разделенные пробелом: ")
    if sp_symbol not in stroka:
        summa += summ(stroka)
        print(summa)
else:
    stroka = stroka[:stroka.index(sp_symbol)]
    summa += summ(stroka)
    print(summa)

# 6. Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и возвращающую их же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.

slova = input("Введите слово из маленьких латинских букв: ")

def int_func(slova):
    """ Принимает слово из маленьких латинских букв и возвращает его с прописной первой буквой."""
    slova_z = slova.title()
    return slova_z

print(int_func(slova))

# 7. Продолжить работу над заданием. В программу должна попадать строка из слов, разделённых пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Нужно сделать вывод исходной строки,
# но каждое слово должно начинаться с заглавной буквы. Используйте написанную ранее функцию int_func().

slova = input("Введите слова из маленьких латинских букв, разделенных пробелом: ")

def int_func(slova):
    """ Принимает слова из маленьких латинских букв и возвращает их с прописными первыми буквами."""
    slova_z = slova.title()
    return slova_z

print(int_func(slova))