# 5. Создать (программно) текстовый файл, записать в него программно набор
# чисел, разделённых пробелами. Программа должна подсчитывать сумму чисел
# в файле и выводить её на экран.

sp = ["4", "68", "42", "87", "45", "9", "143", "98", "1"]
summa = 0
with open("test5.txt", "w+", encoding = "utf-8") as my_f:
    my_f.write(str(" ".join(sp)))
    sp0 = my_f.read()
    for i in range(len(sp0.split())):
        summa += int(sp0.split()[i])
print(f"Сумма чисел в файле '{my_f.name}': {summa}")